SITE_CHOICE = (
    ('ab', 'AutoBazar'),
    ('ria', 'AuroRia'),
    ('olx', 'Olx'),
)

DRIVE_CHOICE = (
    (None, 'Не указан'),
    (1, 'Передний'),
    (2, 'Задний'),
    (3, 'Полный'),
)

BODY_CHOICE = (
    (None, 'Не указан'),
    (1, 'шасси'),
    (2, 'универсал'),
    (3, 'седан'),
    (4, 'хэтчбек'),
    (5, 'внедорожник/кроссовер'),
    (6, 'купе'),
    (7, 'кабриолет'),
    (8, 'минивэн'),
    (9, 'пикап'),
    (11, 'микроавтобус'),
    (219, 'микроавтобус'),
    (12, 'борт'),
    (13, 'тарга'),
    (14, 'фастбэк'),
    (28, 'другой'),
    (153, 'фургон'),
    (252, 'лимузин'),
    (254, 'легковой фургон'),
    (307, 'лифтбек'),
    (315, 'родстер'),
    (210, 'микроавтобус грузовой'),
)

GEARBOX_CHOICE = (
    (None, 'Все КПП'),
    (1, 'Механика'),
    (2, 'Автомат'),
)

CLEARED_CHOISE = (
    (None, 'Любая регистрация'),
    (1, 'Растаможенные'),
    (0, 'Не растаможенные'),
)

DTP_CHOISE = (
    (None, 'Любое состояние'),
    (0, 'Без ДТП'),
    (1, 'После ДТП'),
)

LOCATION_CHOICE = (
    (None, 'Все регионы'),
    (1, 'киевская обл.'),
    (2, 'винницкая обл.'),
    (3, 'волынская обл.'),
    (4, 'днепропетровская обл.'),
    (5, 'донецкая обл.'),
    (6, 'житомирская обл.'),
    (7, 'закарпатская обл.'),
    (8, 'запорожская обл.'),
    (9, 'ивано-франковская обл.'),
    (10, 'кировоградская обл.'),
    (11, 'луганская обл.'),
    (12, 'львовская обл.'),
    (13, 'николаевская обл.'),
    (14, 'одесская обл.'),
    (15, 'полтавская обл.'),
    (16, 'республика крым'),
    (17, 'ровенская обл.'),
    (18, 'сумская обл.'),
    (19, 'тернопольская обл.'),
    (20, 'харьковская обл.'),
    (21, 'херсонская обл.'),
    (22, 'хмельницкая обл.'),
    (23, 'черкасская обл.'),
    (24, 'черниговская обл.'),
    (25, 'черновицкая обл.')
)

FUEL_CHOICE = (
    (None, 'Любой'),
    (1, 'Бензин'),
    (2, 'Дизель'),
    (3, 'Газ'),
    (4, 'Газ/бензин'),
    (5, 'Гибрид'),
    (6, 'Электро'),
    (7, 'Другое'),
    (8, 'Газметан'),
    (9, 'Газпропан-бутан'),
)
